{
  "Navbar": {
    "about": "About",
    "skills": "Skills",
    "projects": "Projects",
    "education": "Education",
    "contact": "Contact"
  },
  "About": {
    "title": "FULL STACK DEVELOPER",
    "description": "Full stack software engineer building modern, high-performance web applications with React, Angular, Next.js, Spring Boot, and Node.js. Passionate about tech, I turn ideas into robust, accessible, and scalable solutions.",
    "hireMe": "Hire Me",
    "contact": "Contact"
  },
  "Skills": {
    "title": "Skills",
    "subtitle": "A quick overview of the tools and technologies I work with."
  },
  "Formation": {
    "title": "Education and Professional Experience",
    "subtitle": "My academic background and hands-on professional experiences.",
    "bachelorDegree": "Bachelor’s Degree in Computer Science",
    "engineeringInternship": "Engineering Internship",
    "finalInternship": "Final Internship",
    "immersionInternship": "Immersion Internship",
    "highSchoolDiploma": "High School Diploma",
    "engineerDegree": "Engineering Degree",
    "fst": "Faculty of Sciences of Tunis",
    "sntp": "National Petroleum Distribution Company (SNDP) - AGIL",
    "ministry": "Ministry of Planning and Economy",
    "zitounaBank": "Banque Zitouna",
    "esprit": "ESPRIT - Private Higher School of Engineering and Technology",
    "highSchool": "High School of Khmaies El Hajri - Jendouba",
    "bachelor": "Earned a solid foundation in computer science with coursework in algorithms, data structures, and software engineering.",
    "finalInternshipSNDP": "End-of-studies project focused on software development and system integration at SNDP (AGIL).",
    "immersionMinistry": "Completed a company immersion internship observing IT operations at the Ministry of Planning and Economy.",
    "engineeringInternshipZitouna": "Completed an engineering internship focused on backend and microservices architecture at Banque Zitouna.",
    "finalInternshipZitouna": "Final engineering project involving application design and implementation at Banque Zitouna.",
    "espritDescription": "Engineering program focused on full stack development, agile methodologies, project management, and building robust software solutions.",
    "highSchoolDesc": "Obtained the baccalaureate in Mathematics in 2016."
  },
  "Contact": {
    "title": "Let's Connect",
    "subtitle": "Interested in working together, hiring me, or just want to say hello? Feel free to reach out!"
  },
  "Projects":{
    "title": "Projects",
    "subtitle": "A showcase of my most impactful and technically diverse work, developed during internships, personal initiatives, and academic experiences.",
    "pfeFstTitle": "Mission Management System – SNDP",
    "pfeFstDescription": "Developed a backend system for mission and expense management at SNDP during my internship. Implemented modules for user authentication (sign-in, logout, JWT), vehicle management, gas consumption tracking, and employee expense handling. Included a smart order workflow where supervisors approve missions and finance reimburses expenses post-mission.",
    "pfeFstTask1":"Set up Node.js + Express backend",
    "pfeFstTask2":"Implemented user module with JWT auth",
    "pfeFstTask3":"Developed vehicle and gas tracking modules",
    "pfeFstTask4":"Built mission approval and reimbursement workflow",
    "pidev3Title": "Internship Finder Platform – PiDev",
    "pidev3Description": "Developed a platform where students can search for internships and companies can post opportunities. The app also provides quizzes and training courses for students to earn certificates and showcase their skills. My contribution focused on the quiz module, including randomized questions by topic, scoring, and a leaderboard.",
    "pidev3Task1": "Built quiz module with topic-based randomized questions",
    "pidev3Task2": "Implemented score calculation and certification logic",
    "pidev3Task3": "Developed a dynamic leaderboard",
    "immersionTitle": "Meeting Management System – Immersion Internship",
    "immersionDescription": "Developed a complete application for managing internal meetings during my immersion internship. Employees can schedule meetings, supervisors approve or reject them, and the system tracks which staff are currently in meetings or available.",
    "immersionTask1": "Designed full-stack meeting management workflow",
    "immersionTask2": "Implemented supervisor approval system",
    "immersionTask3": "Added staff availability tracking module",
    "pidev4Title": "Microfinance Platform – PiDev",
    "pidev4Description": "Contributed to building a digital platform for microfinance institutions that fund small projects through loans. I developed the loan management module (add, remove, consult, simulate), and integrated an intelligent KNN-based machine learning system to predict whether the project fits within the requested amount, helping the institution optimize funding decisions.",
    "pidev4Task1": "Developed the loan management module (add, delete, consult, simulate)",
    "pidev4Task2": "Integrated a KNN algorithm to assess loan range accuracy",
    "pidev4Task3": "Enhanced funding decisions using predictive intelligence",
    "zitounaEngTitle": "Engineering Internship – Banque Zitouna",
    "zitounaEngDescription": "During my engineering internship at Banque Zitouna, I conducted regression testing on the Carthago system to ensure application stability and explored the T24 banking system to understand its functionality and integrations.",
    "zitounaEngTask1": "Conducted regression testing on the Carthago system to ensure stability",
    "zitounaEngTask2": "Explored and analyzed the T24 banking system for functionality and integrations",
    "pidev5Title": "Beginner-Friendly Trading App – PiDev",
    "pidev5Description": "Contributed to building a friendly trading application for amateur users, offering a safe environment to learn and practice trading using real-time data. I worked on the dashboard that includes candlestick charts and integrated it with live data using WebSockets.",
    "pidev5Task1": "Designed a dashboard with candlestick chart components",
    "pidev5Task2": "Integrated real-time data feeds using WebSockets",
    "zitounaPfeTitle": "Graduation Project – Banque Zitouna",
    "zitounaPfeDescription": "Automated the feasibility study process for risk-related loans to improve operational efficiency. Developed a workflow application using Power Apps, SharePoint, and Power Automate. Also optimized processes and generated financial reports to support decision-making.",
    "zitounaPfeTask1": "Automated the feasibility study process for risk loans",
    "zitounaPfeTask2": "Built a workflow application using Power Apps, SharePoint, and Power Automate",
    "zitounaPfeTask3": "Optimized processes and generated decision-support financial reports",
    "freelanceErpTitle": "ERP Development from Scratch – Freelance Project",
    "freelanceErpDescription": "Built a complete ERP system from scratch as a freelance project. It handles products, invoices, quotes, clients, suppliers, and user management. I used Angular for the frontend, Spring Boot for the backend, MySQL for the database, and deployed it on an Ubuntu server.",
    "freelanceErpTask1": "Designed and developed user interfaces using Angular",
    "freelanceErpTask2": "Built backend APIs and managed the database using Spring Boot and MySQL",
    "freelanceErpTask3": "Deployed and configured the system on an Ubuntu server",
    "ecochimixSiteTitle": "Showcase Website – STE Ecochimix (Freelance)",
    "ecochimixSiteDescription": "Designed and developed a modern, responsive showcase website for STE Ecochimix. Focused on user experience and SEO optimization using Next.js.",
    "ecochimixSiteTask1": "Designed and developed a responsive showcase website",
    "ecochimixSiteTask2": "Enhanced performance and SEO using Next.js",
    "portfolioTitle": "Personal Website – Portfolio",
    "portfolioDescription": "Built a responsive personal portfolio using Next.js and Tailwind CSS to showcase my career path and projects. The site supports multilingual content and features a clean, elegant UI with dynamic project rendering.",
    "portfolioTask1": "Designed and developed the interface using Next.js and Tailwind CSS",
    "portfolioTask2": "Implemented multilingual support (i18n) for Arabic, French, and English",
    "portfolioTask3": "Connected dynamic project and experience sections"
  }
}
