{
  "Navbar": {
    "about": "À propos",
    "skills": "Compétences",
    "education": "Formations",
    "projects": "Projets",
    "contact": "Contact"
  },
  "About": {
    "title": "DÉVELOPPEUR FULL STACK",
    "description": "Ingénieur en informatique spécialisé en développement full stack, je conçois des applications web modernes et performantes en combinant React, Angular, Next.js, Spring Boot et Node.js.\nPassionné par la technologie, je transforme les idées en solutions robustes, accessibles et évolutives.",
    "hireMe": "Engagez-moi",
    "contact": "Contact"  
  },
  "Skills": {
    "title": "Skills",
    "subtitle": "Un aperçu rapide des outils et technologies que j'utilise."
  },
  "Formation": {
    "title": "Formation et Expérience Professionnelle",
    "subtitle":"Mon parcours académique et mes expériences professionnelles concrètes.",
    "bachelorDegree": "Licence Fondamentale en Informatique",
    "engineeringInternship": "Stage Ingénieur",
    "finalInternship": "Stage de Fin d'Études",
    "immersionInternship": "Stage d’Immersion",
    "engineerDegree": "Diplôme d'Ingénieur",
    "highSchoolDiploma": "Baccalauréat",
    "fst": "Faculté des Sciences de Tunis",
    "sntp": "Société Nationale de Distribution de Pétrole (SNDP) - AGIL",
    "ministry": "Ministère de la Planification et de l'Économie",
    "zitounaBank": "Banque Zitouna",
    "esprit": "ESPRIT - École Supérieure Privée d'Ingénierie et de Technologie",
    "highSchool": "Lycée Khmaies El Hajri - Jendouba",
    "bachelor": "Solide formation en informatique avec des cours sur les algorithmes, les structures de données et le développement logiciel.",
    "finalInternshipSNDP": "Projet de fin d’études axé sur le développement logiciel et l’intégration de systèmes à la SNDP (AGIL).",
    "immersionMinistry": "Stage d'immersion en entreprise au sein du Ministère de la Planification et de l'Économie.",
    "engineeringInternshipZitouna": "Stage ingénieur axé sur le backend et l’architecture microservices à la Banque Zitouna.",
    "finalInternshipZitouna": "Projet final d’ingénieur portant sur la conception et l’implémentation d’applications à la Banque Zitouna.",
    "highSchoolDesc": "Obtention du baccalauréat en Mathématiques en 2016.",
    "espritDescription": "Formation d'ingénieur avec une spécialisation en développement full stack, méthodologies agiles, gestion de projet, et développement de solutions logicielles robustes."
  },
  "Contact": {
    "title": "Entrons en contact",
    "subtitle": "Envie de collaborer, me recruter ou simplement dire bonjour ? N'hésitez pas à me contacter !"
  },
  "Projects":{
    "title": "Projets",
    "subtitle": "Une vitrine de mes travaux les plus marquants et variés techniquement, réalisés lors de stages, de projets personnels et académiques.",
    "pfeFstTitle":"Système de Gestion des Missions – SNDP",
    "pfeFstDescription": "Développement d'un système backend de gestion des missions et des dépenses à la SNDP pendant mon stage. Création des modules d’authentification utilisateur (connexion, déconnexion, JWT), gestion des véhicules, suivi de consommation de gaz, et gestion des dépenses des employés. Mise en place d’un flux intelligent où les supérieurs valident les missions et le service financier rembourse après mission.",
    "pfeFstTask1":"Mise en place du backend Node.js + Express",
    "pfeFstTask2":"Implémentation du module utilisateur avec JWT",
    "pfeFstTask3":"Développement des modules de véhicules et de consommation",
    "pfeFstTask4":"Création du workflow d’approbation et de remboursement",
    "pidev3Title": "Plateforme de Recherche de Stages – PiDev",
    "pidev3Description": "Développement d'une plateforme où les étudiants peuvent chercher des stages et les entreprises publier leurs offres. L'application propose également des quiz et des formations permettant aux étudiants d'obtenir des certificats et de valoriser leurs compétences. Ma contribution s'est concentrée sur le module de quiz avec questions aléatoires par sujet, calcul de score et classement.",
    "pidev3Task1": "Développement du module de quiz avec des questions aléatoires par sujet",
    "pidev3Task2": "Mise en œuvre du calcul de score et de la génération de certificats",
    "pidev3Task3": "Création d’un classement dynamique",
    "immersionTitle": "Système de Gestion des Réunions – Stage d'Immersion",
    "immersionDescription": "Développement d’une application complète de gestion des réunions internes lors de mon stage d'immersion. Les employés peuvent planifier des réunions, les supérieurs les valident ou non, et le système suit en temps réel la disponibilité du personnel.",
    "immersionTask1": "Conception du flux complet de gestion des réunions",
    "immersionTask2": "Mise en œuvre du système d’approbation par les supérieurs",
    "immersionTask3": "Ajout d’un module de suivi de disponibilité du personnel",
    "pidev4Title": "Plateforme de microfinance – PiDev",
    "pidev4Description": "Participation au développement d'une plateforme numérique pour les institutions de microfinance finançant des petits projets par des prêts. J'ai réalisé le module de gestion des prêts (ajout, suppression, consultation, simulation), et intégré un système intelligent basé sur l’algorithme KNN pour prédire si un projet est cohérent avec le montant demandé, afin d’optimiser les décisions de financement.",
    "pidev4Task1": "Développement du module de gestion des prêts (ajout, suppression, consultation, simulation)",
    "pidev4Task2": "Intégration de l'algorithme KNN pour évaluer la cohérence des montants",
    "pidev4Task3": "Optimisation des décisions de financement grâce à la prédiction intelligente",
    "zitounaEngTitle": "Stage d'ingénieur – Banque Zitouna",
    "zitounaEngDescription": "Lors de mon stage d’ingénieur à Banque Zitouna, j’ai réalisé des tests de régression sur le système Carthago pour assurer la stabilité de l’application et analysé le système bancaire T24 pour en comprendre le fonctionnement et les intégrations.",
    "zitounaEngTask1": "Effectuer des tests de régression sur le système Carthago pour garantir la stabilité",
    "zitounaEngTask2": "Analyser le système bancaire T24 pour comprendre son fonctionnement et ses intégrations",
    "pidev5Title": "Application de trading pour débutants – PiDev",
    "pidev5Description": "Participation au développement d'une application de trading conviviale destinée aux débutants, offrant un environnement sécurisé pour apprendre et s'entraîner avec des données en temps réel. J'ai conçu le tableau de bord avec des graphiques en chandeliers et l'ai connecté aux données en direct via WebSockets.",
    "pidev5Task1": "Conception d’un tableau de bord avec des graphiques en chandeliers",
    "pidev5Task2": "Intégration des flux de données en temps réel via WebSockets",
    "zitounaPfeTitle": "Projet de fin d’études – Banque Zitouna",
    "zitounaPfeDescription": "Automatisation du processus d’étude de faisabilité pour les prêts à risque, améliorant ainsi l'efficacité opérationnelle. Développement d'une application de gestion de flux de travail avec Power Apps, SharePoint et Power Automate. Optimisation des processus et génération de rapports financiers pour faciliter la prise de décision.",
    "zitounaPfeTask1": "Automatiser l'étude de faisabilité des prêts à risque",
    "zitounaPfeTask2": "Développer une application de gestion de flux avec Power Apps, SharePoint et Power Automate",
    "zitounaPfeTask3": "Optimiser les processus et générer des rapports financiers d’aide à la décision",
    "freelanceErpTitle": "Développement d’un ERP complet – Projet freelance",
    "freelanceErpDescription": "Création d’un système ERP complet depuis zéro dans le cadre d’un projet freelance. Le système gère les produits, les factures, les devis, les clients, les fournisseurs et les utilisateurs. Utilisation d’Angular pour le frontend, Spring Boot pour le backend, MySQL pour la base de données, et déploiement sur un serveur Ubuntu.",
    "freelanceErpTask1": "Conception et développement des interfaces utilisateur avec Angular",
    "freelanceErpTask2": "Création des APIs backend et gestion de la base de données avec Spring Boot et MySQL",
    "freelanceErpTask3": "Déploiement et configuration du système sur un serveur Ubuntu",
    "ecochimixSiteTitle": "Site vitrine – STE Ecochimix (Freelance)",
    "ecochimixSiteDescription": "Conception et développement d’un site vitrine moderne et responsive pour STE Ecochimix. Amélioration de l’expérience utilisateur et du référencement SEO grâce à Next.js.",
    "ecochimixSiteTask1": "Concevoir et développer un site vitrine responsive",
    "ecochimixSiteTask2": "Optimiser la performance et le SEO avec Next.js",
    "portfolioTitle": "Site personnel – Portfolio",
    "portfolioDescription": "Création d’un site personnel avec Next.js et Tailwind CSS pour présenter mon parcours et mes projets. Le site est responsive, multilingue, avec une interface élégante et une gestion dynamique des projets.",
    "portfolioTask1": "Conception et développement de l’interface avec Next.js et Tailwind CSS",
    "portfolioTask2": "Implémentation du support multilingue (i18n) pour l’arabe, le français et l’anglais",
    "portfolioTask3": "Connexion dynamique des sections projets et expériences"
  }
}
